In [2]:
import numpy as np
import pandas as pd

In [4]:
# Dealing with missing Data
'''
3 ways to deal with missing data:
- Leave it as missing data
- Remove the missing data
- Filling the missing data (Filling with a non-trivial data such that it won't affect mean, median and mode.
'''

"\n3 ways to deal with missing data:\n- Leave it as missing data\n- Remove the missing data\n- Filling the missing data (Filling with a non-trivial data such that it won't affect mean, median and mode.\n"

In [36]:
df = pd.DataFrame ({'A':[1,2,np.nan,4],
                    'B':[5,np.nan,np.nan,8],
                    'C':[10,20,30,40]})

In [7]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
# Remove all the missing data
df.dropna()

In [11]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [10]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [18]:
df.dropna(axis=1,thresh=2) # It atleast requires 2 non-null values to be displayed

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [17]:
df.dropna(axis=1,thresh=3) # It atleast requires 3 non-null values to be displayed

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [19]:
len(df)

4

In [20]:
# Filling the missing data
df.fillna(value='FILL VALUE')

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3         4.0         8.0  40

In [21]:
df.dtypes

A    float64
B    float64
C      int64
dtype: object

In [22]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [25]:
df_1 = df

In [26]:
df_1

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [27]:
# Filling only column A with zeros in the missing values
df_1['A'] = df['A'].fillna(value=0)

In [28]:
df_1

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [32]:
# Filling missing values of B with avg. values of B across
df['B'].mean()

6.5

In [37]:
df_1['B'] = df['B'].fillna(value=df['B'].mean())

In [38]:
df_1

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

In [39]:
# Fills all missing values with the avg. values at the columns
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40